In [9]:
#pandas Libraray
import pandas as pd
# Creating a Series
s= pd.Series([ 100, 200, 300, 400, 500], index=['i', 'ii', 'iii', 'iv', 'v'])
print("Pandas Series:")
print(s)
print("\nAccess single value:", s['i'])

Pandas Series:
i      100
ii     200
iii    300
iv     400
v      500
dtype: int64

Access single value: 100

In [10]:
type(s)

pandas.core.series.Series

In [11]:
# Creating a DataFrame
data = {
    'Name': ['Kaveri', 'Karan','Vaishnavi'],
    'Age': [21, 20, 23],
    'Marks': [90,70,85]
}

df = pd.DataFrame(data)

print("Pandas DataFrame:")
print(df)
print("\nAccess single column (as Series):")
print(df['Marks'])

Pandas DataFrame:
        Name  Age  Marks
0     Kaveri   21     90
1      Karan   20     70
2  Vaishnavi   23     85

Access single column (as Series):
0    90
1    70
2    85
Name: Marks, dtype: int64

In [12]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
#load csv file
pd.read_csv("airlines_flights_data.csv")

,index,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1,5955
...,...,...,...,...,...,...,...,...,...,...,...,...
300148,300148,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,69265
300149,300149,Vistara,UK-826,Chennai,Afternoon,one,Night,Hyderabad,Business,10.42,49,77105
300150,300150,Vistara,UK-832,Chennai,Early_Morning,one,Night,Hyderabad,Business,13.83,49,79099
300151,300151,Vistara,UK-828,Chennai,Early_Morning,one,Evening,Hyderabad,Business,10.00,49,81585
300152,300152,Vistara,UK-822,Chennai,Morning,one,Evening,Hyderabad,Business,10.08,49,81585

In [15]:
df.to_csv("output.csv", index=False)   # save to CSV

In [22]:
#perform arithmatic operation
s = pd.Series([7, 20, 70, 50])
print("Original:\n", s)
print("\nAdding 2:\n", s+2)

Original:
 0     7
1    20
2    70
3    50
dtype: int64

Adding 2:
 0     9
1    22
2    72
3    52
dtype: int64

In [25]:
df['Name']             # select single column

0       Kaveri
1        Karan
2    Vaishnavi
Name: Name, dtype: object

In [26]:
df[['Name','Marks']]   # select multiple columns

        Name  Marks
0     Kaveri     90
1      Karan     70
2  Vaishnavi     85

In [27]:
df.iloc[0]             # first row by index

Name     Kaveri
Age          21
Marks        90
Name: 0, dtype: object

In [28]:
df.iloc[1:4]           # rows by index range

        Name  Age  Marks
1      Karan   20     70
2  Vaishnavi   23     85

In [29]:
df.loc[df['Marks']>85] # filter condition

     Name  Age  Marks
0  Kaveri   21     90

In [30]:
df.head()        # first 5 rows

        Name  Age  Marks
0     Kaveri   21     90
1      Karan   20     70
2  Vaishnavi   23     85

In [31]:
df.tail()        # last 5 rows

        Name  Age  Marks
0     Kaveri   21     90
1      Karan   20     70
2  Vaishnavi   23     85

In [32]:
df.shape         # (rows, columns)

(3, 3)

In [33]:
df.info()        # summary (data types, non-null count)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [34]:
df.dtypes        # data types of each column

Name     object
Age       int64
Marks     int64
dtype: object

In [35]:
df.describe()    # summary statistics (mean, std, min, max, etc.)

             Age      Marks
count   3.000000   3.000000
mean   21.333333  81.666667
std     1.527525  10.408330
min    20.000000  70.000000
25%    20.500000  77.500000
50%    21.000000  85.000000
75%    22.000000  87.500000
max    23.000000  90.000000

In [36]:
df.columns       # list of column names

Index(['Name', 'Age', 'Marks'], dtype='object')

In [37]:
df.index      #index of dataframe

RangeIndex(start=0, stop=3, step=1)

In [39]:
df.describe()
df['Marks'].mean()     # average marks

np.float64(81.66666666666667)

In [40]:
df['Marks'].median()   # median

np.float64(85.0)

In [41]:
df['Marks'].max()      # maximum value

np.int64(90)

In [42]:
df['Marks'].min()      # minimum value

np.int64(70)

In [43]:
df['Marks'].sum()      # sum of column

np.int64(245)

In [44]:
df['Marks'].value_counts()  # frequency count

Marks
90    1
70    1
85    1
Name: count, dtype: int64